"----------------------------------------
"     Search
"----------------------------------------
set t_Co=256
" インクリメンタル検索 (検索ワードの最初の文字を入力した時点で検索が開始)
set incsearch
" 検索結果をハイライト表示
set hlsearch

"----------------------------------------
"     Display
"----------------------------------------
" ウィンドウの右下にまだ実行していない入力中のコマンドを表示
set showcmd
" タブキー押下時に挿入される文字幅を指定
set softtabstop=2
set guioptions-=T
" yでコピーした時にクリップボードに入る
" 対応する括弧を強調表示
set showmatch
" 行番号の表示
set number
" カラースキーム設定
syntax on
colorscheme molokai
